[
    
    
    
    
    {
    "text": "An IIT Mumbai graduate. A PhD holder. A scientist. Now driving a cab in San Jose, trying to make ends meet after being laid off a year ago.\n\nThe world sees the 'American Dream' as this shiny, idealistic vision. But for many immigrants, it’s a battle – a constant tug of war between dreams and reality.\n\nThe driver in this story explains how he can’t go back to India, despite wanting to, because his life is now rooted here – kids in school, mortgage payments, insurance.\n\nThe phrase 'Tasalli Nahin Hai' (there’s no peace) captures it perfectly. Even with all the effort and resilience, there’s a void that hard work alone can’t fill.\n\nIt’s heartbreaking to think about brilliant minds being in positions that don't reflect their capabilities. The driver says he thinks of going back home 'every day,' but the sacrifices make it impossible. This story isn’t just his – it’s the reality of countless others navigating life between what they are and what they’re forced to be.\n\nThis is a reminder: success isn’t always about the title you hold or the work you do. It’s about the value you bring to the world, even if it’s unnoticed by most.\n\nTo all the brilliant, hardworking people out there feeling stuck or undervalued: You are more than your current situation. I hope you find peace and the opportunity to shine again. You deserve it.\n\nIf you’ve faced challenges like this or know someone who has, let’s share stories and support each other. Because sometimes, a little recognition and empathy can go a long way.",
    "engagement": 104
    },

    {
    "text": "I am not a person who puts lessons posts regarding things they learned after anything happens around them.\n\nToday, I have to be that person.\n\nYesterday I attended my first concert - My favourite Diljit's Dil-luminati Tour. (I am a Punjabi :p)\n\nI reached early and saved myself a spot and this was my first time, I was standing in the front area just behind the fence.\n\nA family came with 7 kids, forcing everyone to help their kids come forward so that they can see.\n\nI gave a spot to one of them, then slowly the sisters started b*tching about everyone in the front row - 'Yeh aunty aisi hai, waisi hai'\n\nHer mother asked me to let her come forward and I should step back because 'bache hai yeh log' (they're kids)\n\nI politely declined.\n\nI wasn't born in a privileged family. For this family, the father paid for 9 people (as he said)\n\nI am attending a concert for the first time with my hard-earned money.\n\nThis is my first time experience as well.\n\nI would've thought about helping the family if the kids were kind but unfortunately they were very rude. They called a lot of people 'b*tch', 'stupid' etc in front of me (including me)\n\nAs the concert progressed, everyone started dancing, the family had problems with that as well.\n\n'Haath aa rahe hai inke photo mein' (Their hand is coming in between)\n'Seedhe kyu nahi khade rehte, video kharab kar di' (Why can't they stand straight, they're ruining my video)\n\nA humble request to everyone out here -\n\nKids are beautiful. I don't hate children but don't expect others to be kind with them all the time just because they're 'children' - respect isn't dependent on age.\n\nTo all the parents who have the money to give their children the best out here - I am happy for you but you need to understand that some of us come from the middle class and we're paying for these things from our hard-earned money.\n\nSometimes the children forget basic 'sanskaar' because they're used to getting everything they want without realising it's worth.\n\n'Jaha humaare sapne pure hote hai, waha innke struggle shuru hote hai'\n\nThoughts?",
    "engagement": 89
    },

    {
        "text": "We need to work hard so that he can gift a toddler 240 crores worth of shares.\n\nWorking hard is just for middle class people so that we can help the elite class get richer.\n\nGuys work hard so that the 240 crores become 1000 crores and the grandchild doesn't have to work more.",
        "engagement": 353
    },

    {
        "text": "Some weeks you'll be moving mountains.\n\nSome weeks you'll barely have the power to get out of the bed.\n\nProgress is progress, it is not linear.\n\nWhatever week you're having, just remind yourself of the progress you've made.\n\nIn case no one has told you today/ you didn't remind yourself -\n\nYou're strong and brave.\n\nKeep going!\n\nIt's okay to have a bad day/week.",
        "engagement": 145
    },

    {
        "text": "I recently got a chance to participate in my first 21 km marathon.\n\nHonestly, I am that Typical 'gym bro' who has been lifting weights for a long time but hates cardio.\n\nI do power lifting, I can do yoga, dance and what not but 'RUNNING' - I am terrified of it.\n\nAfter the marathon I got blisters on my feet and pain in my right feet because I am not a regular 'runner'\n\nThe major thing that I learned from this marathon -\n\nJust don't quit. Keep going.\n\nIf you can't run, walk or crawl but keep going.\n\nI was in the last batch of people that completed the marathon but I am so happy that I completed it.\n\nMany people quit the marathon in between.\n\nSome people cheated in between- took bikes and autos to complete the marathon.\n\nI walked, kept on walking and was alone in the end because most of the people were ahead of me. This is from a person who cannot run 1 km but didn't give up for 21 km.\n\nI went through lots of health issues and here I am proud of myself that I completed my first half marathon and looking forward to more of these :)\n\nHere's to more trying and not giving up 💪",
        "engagement": 208
    },

    {
        "text": "Had an appointment today.\n\nWhile coming back, my Uber driver and I had a conversation.\n\nI noticed the headset with the mic and then he said I am talking to the Queen.\n\nSaw the screen and the contact number was saved as 'My Queen 👑'\n\nIt was the most wholesome thing that I saw in a while.\n\nAlways take out time for the people that you love and let them know that they mean a lot to you.\n\nLife is short.\n\nYour work should not be above your relationships.\n\nYou can earn all the money in this world but you cannot buy relationships with them.\n\nP.S - I know it's dangerous to talk while driving, after a while he disconnected the call and drove without talking.",
        "engagement": 331
    },

    {
        "text": "Saw someone offer a course on - 'how to become a Roadie'\n\nI think that I've seen everything now.\n\nAt least they aren't selling you that course at INR 9 and promising you placement guarantee.",
        "engagement": 68
    },

    {
        "text": "I've been improving myself, working on myself one day at a time.\n\nAre you interested in watching my journey?\n\nI've been reading lots of books, to become a better version of myself.\n\nI am planning to make small vlogs everyday (~10 mins) and upload it on YouTube.\n\nWill you be interested in watching them?\n\nI'll start with Emotional Intelligence first and then gradually dive deeper.\n\nI'll keep it raw and wholesome. If you love my content here, you'll love these videos.\n\nPlease help me with your suggestions! If you like the idea pls write 'yes' and if you've any suggestions pls add them below.\n\nThey'll not be about generic motivation but more about understanding ourselves and improvement.\n\nLet's grow together :)",
        "engagement": 92
    },

    {
        "text": "People be like: 'Meditate, it will fix everything.' \n\nMeanwhile, Indian relatives: 'Beta, just work harder, that’s the best therapy.' 😂 \n\nMental health is becoming a real conversation, but we’ve still got a long way to go! \n\nWhat’s the most ‘Indian’ mental health advice you’ve received? \nMine was - \n\n'So jao, sabb sahi ho jaayega!' \n\n'Depression ke baare mein soch soch ke depression ho raha hai tumko!' \n\n'Yeh Therapist ne tumhara dimag kharab kar diya ha'",
        "engagement": 143
    },

    {
        "text": "Trigger warning - Mention of suicide and self-harm.\n\nI talk a lot about mental health in my posts but I want to address a few concerns.\n\n-Therapy is expensive. \nWhen I started with my current therapist it was 1500/hour and now turned to 2000/hour.\nHonestly, this is a price that many people cannot afford.\nSometimes I hold myself as well, I cannot afford to pay this amount for a month.\n\nAnother thing that I'll want to address:\n-Most of the time, these bills are not reimbursable under your workplace's health policy.\nSo, you have to pay this from your own pocket.\n\nThis email is from my college era.\nI was struggling and had thoughts of self-harm and suicide, some of which I practiced.\nI desperately needed help.\nI couldn't afford therapy.\nNaturally, I tried free resources. \nSome didn’t answer, some had long delays in responding – days, even weeks. When you’re at your lowest, waiting weeks for help doesn’t work.\n\nWhat I want to call out here is - \nThe truth is, even though we talk about mental health more today, affordable access to counselors and therapists is still a privilege. \nFree resources exist, but they aren’t always efficient or readily available when someone is in crisis.\n\nThis wasn't the first time that I tried/had thoughts of harming myself and it wasn't definitely the last.\n\nWhile I am thankful for such organisations, personally they were of no use for me.\nYou go to the internet for help when you don't have any other options left, getting a reply after 3-4 weeks may not be helpful for you.\nAs a college student, I didn't have funds nor knowledge on how to approach these thoughts and how to get myself out of this.\n\nEvery time I post about these things, people still think that it is for seeking attention.\nI do seek attention but not for myself.\nI want you to talk about this.\nI want us to learn the basics at least on how to talk to a person who is going through something and don't have the money for therapy.\nI want you to check on your friends and family.\n\nYour words and presence might mean more than you realize.\n\nAnd the most important thing-\nPlease don't hire/listen to people who are not qualified for working with people dealing with mental health problems.\nI had a terrible experience that I'll probably share later.\n\nIt’s not easy to be vulnerable here, but I hope that by sharing my experience, someone else might feel less alone or feel encouraged to seek help.\n\nIf you’re going through something right now, know that you’re not alone. Reaching out is hard, but your feelings are valid, and help is out there – even if it feels far away at times.\n\nEvery year, millions of people struggle with mental health battles they keep hidden. \nIn fact, suicide rates have been increasing worldwide, and it’s one of the leading causes of death, especially among young people. \n\nIn the end, I'll just like to say-\nPeople are already going through a lot, please don't make their life harder. Be kind, it costs nothing.",
        "engagement": 208
    },

    {
        "text": "This particular mail gets on my nerves.\n\nPortray this as a job and then say 'pay after placement' because it is a course not a job.\n\nWhat kind of fake dreams are you showing to the freshers?\n\nSo absurd.\n\nNeech level marketing.\n\nThis should have some legal action taken against the ad.\n\nSuch a vacuous way of marketing.",
        "engagement": 323
    },

    {
        "text": "Sometimes I wonder what people think of me?\n\nHonestly it's so funny to get comments like these :)\n\nLast week I also got an offer to act because I look good in my profile.\n\nDon't get me started on the proposals I get for marriage.\n\nApparently, I've married, have kids and then divorced too 😭\n\nYeh sabb kabb hua, even I don't know.\n\nSocial media is such a wild place.\n\nOG People - 'Muslim' Handa got real.\n\nQuestion -\nShould I ask for alimony to raise 'my' kids? 🙂\n\nHappy Diwali from me and my children. 🪔🙂",
        "engagement": 182
    },

    {
        "text": "I've been in my hometown for Diwali and let me tell you it hits differently.\n\nNo Zepto, Instamart, Blinkit etc, my mom asks me to get anything I am going to Kirana shops, have a good conversation and get the things.\n\nGoing to fruit and vegetable vendors, dairy daily is now a highlight of my day.\n\nThese moments remind me of a time when things were slower, but warmer.\n\nThere’s no Ola or Uber either. If we need to get somewhere, we hop onto an e-rickshaw, sharing the ride with strangers who somehow don’t feel like strangers. That simple experience brings a kind of joy you can’t find on an app.\n\nEven for Diwali lights and decorations, I have to wander through the market, feeling the buzz of the festive crowd. There’s no one-day delivery to bring the season to your doorstep—you have to go out and soak it in yourself.\n\nPeople have been posting about getting a silver coin from Zepto in 10 mins, I got it in 10 mins too but I went out and talked and had a warm exchange :)\n\nThis visit has reminded me that, sometimes, technology isolates us more than it connects us. Being here, surrounded by real conversations and real faces, makes me realize how much we’re missing in the rush of convenience.\n\nIt’s warm, it’s real, and I wish we didn’t lose this in our fast-paced lives.\n\nI also request everyone to support local vendors :)\n\nIt's festive season for them as well\n\nHappy Diwali 🎇 🪔",
        "engagement": 319
    },

    {
        "text": "Sotmate and sreplaced be like -\n\nSadak se uthake 'mentor' bana dunga.\n\nWe need some kind of verification here.\n\nTill then, savdhan rahe, satark rahe.",
        "engagement": 95
    },

    {
        "text": "🚨 Beware of the 'Pay After Placement' Trap 🚨\n\nIndian edtech companies are promoting 'Pay after placement' schemes. Sounds great, right? But here’s the reality:\n\n🔹 Some companies still charge you hidden fees or high-interest rates\n\n🔹 The placement process can be drawn out, or you might be pushed into jobs that aren’t a good fit\n\nIt’s a system full of red flags, and many students end up feeling cheated. \n\nEducation shouldn’t be a gamble. \n\nLet’s call out these practices and demand transparency.\n\n💬 Have you or someone you know fallen into this trap? Let’s spread awareness.",
        "engagement": 132
    },

    {
        "text": "A lot of people on this platform have been comparing themselves with each other.\n\nWhile I do think that healthy competition is good, I don't think praying for someone's downfall is a good thing.\n\nTo everyone here on LinkedIn: \n\nI genuinely want you to achieve your dreams, whether it’s landing your dream job, building something great, or simply finding peace in what you do. Let’s celebrate each other’s successes, not silently root for failure.\n\nIf you agree, let’s spread the positivity. 💙",
        "engagement": 144
    }
        
        
]
    
    